Nombre d'objets =  50
Poids des objets =  [10, 75, 63, 24, 10, 44, 73, 45, 3, 97, 68, 92, 23, 91, 14, 92, 80, 65, 76, 60, 77, 95, 22, 71, 2, 98, 15, 63, 73, 73, 31, 6, 24, 82, 2, 40, 63, 25, 94, 59, 100, 7, 21, 99, 21, 24, 65, 7, 14, 53]
Fragilité des objets =  [140, 141, 144, 145, 147, 151, 152, 159, 160, 162, 172, 179, 181, 185, 186, 193, 194, 196, 198, 199, 205, 206, 210, 212, 216, 219, 221, 223, 223, 227, 233, 235, 238, 245, 249, 254, 259, 262, 262, 263, 268, 272, 277, 278, 284, 289, 292, 296, 297, 299]
 %%%% FORMULATION 1 %%%%% 

----------------------------------
Termination condition:  optimal
Temps de résolution (s) :  0.924873034004122
Meilleure borne inférieure (duale) sur la valeur de la fct obj :  1.0
Meilleure borne supérieure (primal) sur la valeur de la fct obj :  1.0

----------------------------------
Solution optimale :
Gap :  0.0 %
----------------------------------

