Nombre d'objets =  50
Poids des objets =  [11, 71, 34, 82, 52, 18, 94, 11, 89, 17, 10, 87, 7, 33, 48, 66, 58, 5, 12, 26, 21, 10, 78, 92, 50, 81, 80, 89, 30, 7, 80, 70, 11, 18, 11, 3, 20, 63, 82, 21, 67, 5, 4, 6, 27, 36, 46, 31, 7, 19]
Fragilité des objets =  [149, 150, 153, 167, 170, 172, 172, 174, 175, 182, 186, 189, 196, 199, 203, 209, 222, 225, 228, 230, 242, 248, 251, 253, 255, 265, 281, 281, 286, 293, 300, 304, 305, 312, 316, 321, 322, 324, 325, 327, 332, 332, 332, 337, 345, 353, 354, 357, 359, 360]
 %%%% FORMULATION 1 %%%%% 

----------------------------------
Termination condition:  optimal
Temps de résolution (s) :  0.9192769749788567
Meilleure borne inférieure (duale) sur la valeur de la fct obj :  1.0
Meilleure borne supérieure (primal) sur la valeur de la fct obj :  1.0

----------------------------------
Solution optimale :
Gap :  0.0 %
----------------------------------

